app/Controllers/AuthController.php

SELECT `id`, `name`
FROM `services`
ORDER BY `name` ASC
---
    public function index()
    {
        $page = [
            'brand' => 'TERRA NOVA',
            'heroPosition' => 'center',
            'images' => [
                'hero' => base_url('assets/images/hero.jpg'),
                'background' => base_url('assets/images/background.jpg')
            ],
            'links' => [
                'linkedin' => '#',
                'instagram' => '#'
            ],
            'loginUrl' => base_url('login'),
            'csrf' => csrf_hash(),
            'csrfToken' => csrf_token()
        ];

        $db = \Config\Database::connect();

        $services = $db->table('services')
            ->select('id, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `users`
WHERE `email` = 'irakanomena@gmail.com'
 LIMIT 1
SELECT *
FROM `roles`
WHERE `id` = '2'
---
    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        $user = $userModel->where('email', $email)->first();

        if (!$user || !password_verify($password, $user['password_hash'])) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $role = $db->table('roles')
            ->where('id', $user['role_id'])
            ->get()
            ->getRowArray();

SELECT *
FROM `users`
WHERE `email` = 'lala@gmail.com'
 LIMIT 1
INSERT INTO `users` (`role_id`, `name`, `email`, `password_hash`) VALUES (3, 'lala', 'lala@gmail.com', '$2y$10$SldISPJvLhjaSXb3K4.97.JQm6Mx7FGVJ9LlhpNbvE4jeZBZz5SIm')
---
    public function register()
    {
        if ($this->request->getMethod() === 'GET') {
            return view('auth/register');
        }

        $validation = [
            'name'     => 'required|min_length[2]',
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[8]'
        ];

        if (!$this->validate($validation)) {
            return redirect()->to('/register');
        }

        $name = $this->request->getPost('name');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        $existingUser = $userModel->where('email', $email)->first();

        if ($existingUser) {
            return redirect()->to('/register');
        }

        $userModel->insert([
            'role_id'       => 3,
            'name'          => $name,
            'email'         => $email,
            'password_hash' => password_hash($password, PASSWORD_DEFAULT)
        ]);

SELECT `id`, `name`
FROM `services`
ORDER BY `name` ASC
---
    public function registerAgent()
    {
        if ($this->request->getMethod() === 'GET') {
            $services = [];
            try {
                $services = (new ServiceModel())
                    ->select('id, name')
                    ->orderBy('name', 'ASC')
                    ->findAll();

SELECT *
FROM `users`
WHERE `email` = 'irakanomena@gmail.com'
 LIMIT 1
---

        $userModel = new UserModel();

        $existingUser = $userModel->where('email', $email)->first();

INSERT INTO `users` (`role_id`, `service_id`, `name`, `email`, `password_hash`) VALUES (2, '5', 'iraka', 'irakanomena@gmail.com', '$2y$10$5RD/8y1DtApzd7cYYG4RH.xPEqbREie8OBXEnjAaBHUCX1no8TKjO')
---
            return redirect()->to('/login');
        }

        $userModel->insert([
            'role_id'       => 2,
            'service_id'    => $serviceId,
            'name'          => $name,
            'email'         => $email,
            'password_hash' => password_hash($password, PASSWORD_DEFAULT)
        ]);